

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимиостьюФормы();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
//	Если Объект.ИсходящийЗапрос = Ложь Тогда
//		Индекс = ПроверяемыеРеквизиты.Найти("МетодHTTP");
//		Если Индекс <> Неопределено Тогда
//			ПроверяемыеРеквизиты.Удалить(Индекс);	
//		КонецЕсли;		
//	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсходящийЗапросПриИзменении(Элемент)
	УправлениеВидимиостьюФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимиостьюФормы()
	Элементы.МетодHTTP.Видимость =  Объект.ИсходящийЗапрос; 
	Элементы.Адрес.Видимость =  Объект.ИсходящийЗапрос; 
Конецпроцедуры

#КонецОбласти
