
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Период = ТекущаяДатаСеанса();
		Запись.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Ожидание;
		Запись.ДатаОкончания = Дата(1,1,1);
		Запись.ДатаОтправки = Дата(1,1,1);
		Запись.ТекстСообщения = "";
		Запись.ТекстСообщенияОтвет = "";
		Запись.ОписаниеОшибки = "";
		Запись.ИдентификаторЗапроса = Новый УникальныйИдентификатор();	
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
